[
  {
    "id": 1,
    "title": {
      "en": "Teejay Lanka (TJL) - 31%+ Upside, Record Profit",
      "si": "ටීජේ ලංකා (TJL) - 31%+ උඩුගත විභවය, වාර්තාමත් ලාභය",
      "ta": "டீஜே லங்கா (TJL) - 31%+ மேல் நோக்கிய சாத்தியம், சாதனை லாபம்"
    },
    "summary": {
      "en": "TJL FY25 Rev 67B profit 2.8B BUY@49.3 for 31%+ return",
      "si": "TJL FY25 ආදායම 67B ලාභය 2.8B BUY@49.3 සඳහා 31%+ ප්‍රතිලාභය",
      "ta": "TJL FY25 வருவாய் 67B லாபம் 2.8B BUY@49.3க்கு 31%+ வருமானம்"
    },
    "content": {
      "en": "Teejay Lanka (TJL.N: LKR49.3) recorded its highest-ever profit of LKR2.8 bn in FY25 (+152% YoY). The company is diversifying its supply chain, with expansions into Egypt and Indonesia expected to contribute from FY26E. TJL projects 10–15% YoY volume growth in 1QFY26E. If US tariffs impact Sri Lanka, production will shift to its Indian facility (serving US/Japan) and Sri Lankan plant (serving EU). A potential UK-India trade deal offers further export benefits. With synthetics revenue contribution set to reach 25%, we remain positive on TJL with a 12M target price of LKR64.6 (+31% upside).",
      "si": "ටීජේ ලංකා (TJL.N: LKR49.3) FY25 හි වාර්තාමත් ලාභය LKR2.8 බිලියනක් (YoY +152%) වාර්තා කළේය. සමාගම එජිප්තුව සහ ඉන්දුනීසියාව වෙත පුළුල් වීමෙන් සැපයුම් දාමය විවිධාකාර කරමින් ඇත. FY26E සිට මෙය ආදානයට දායක වේ. 1QFY26E හි YoY පරිමාණ වර්ධනය 10–15%ක් ලෙස TJL අපේක්ෂා කරයි. ඇමරිකානු බදු ශ්‍රී ලංකාවට බලපානවා නම්, නිෂ්පාදනය ඉන්දියාවේ (US/Japan) සහ ශ්‍රී ලංකාවේ (EU) කර්මාන්ත ශාලාවන් වෙත මාරු වේ. UK-India වෙළඳ ගිවිසුමක් තවත් අපනයන වාසි ලබා දෙයි. සින්තෙටික් ආදායම 25%ක් දක්වා ඉහළ යන බැවින්, TJL පිළිබඳව අපි ධනාත්මකව සිටිමු (12M ඉලක්ක මිල LKR64.6, +31% උඩුගත විභවය).",
      "ta": "டீஜே லங்கா (TJL.N: LKR49.3) FY25 இல் அதன் மிக உயர்ந்த லாபமான LKR2.8 பில்லியனை (YoY +152%) பதிவு செய்தது. நிறுவனம் எகிப்து மற்றும் இந்தோனேசியா ஆகியவற்றில் விரிவடைவதன் மூலம் வழங்கல் சங்கிலியை பல்வகைப்படுத்துகிறது. FY26E முதல் இது பங்களிக்கும். 1QFY26E இல் YoY அளவு வளர்ச்சி 10–15% என TJL எதிர்பார்க்கிறது. அமெரிக்க வரிகள் இலங்கையை பாதித்தால், உற்பத்தி இந்தியா (US/Japan) மற்றும் இலங்கை (EU) தொழிற்சாலைகளுக்கு மாற்றப்படும். UK-India வர்த்தக ஒப்பந்தம் கூடுதல் ஏற்றுமதி நன்மைகளை வழங்கும். செயற்கை வருவாய் பங்களிப்பு 25% ஆகும் என்பதால், TJL மீது நாங்கள் நேர்மறையாக இருக்கிறோம் (12M இலக்கு விலை LKR64.6, +31% மேல் நோக்கிய சாத்தியம்)."
    },    "category": "Textiles",
    "expectedReturn": "31%",
    "timeFrame": "12 months",
    "publishDate": "2025-06-12",
    "image": "/images/teejay.jpg",
    "source": "Softlogic Research",
    "targetPrice": "LKR 64.6",
    "currentPrice": "LKR 49.3"
  },
  {
    "id": 2,
    "title": {
      "en": "Vallibel ONE (VONE) - 30%+ Upside, Diversified Growth",
      "si": "වල්ලිබෙල් වන් (VONE) - 30%+ උඩුගත විභවය, විවිධ වර්ධනය",
      "ta": "வல்லிபெல் ஒன் (VONE) - 30%+ மேல் நோக்கிய சாத்தியம், பல்துறை வளர்ச்சி"
    },
    "summary": {
      "en": "VONE FY25 Rev 123B profit 12B BUY@82 for 30.4%+ return",
      "si": "VONE FY25 ආදායම 123B ලාභය 12B BUY@82 සඳහා 30.4%+ ප්‍රතිලාභය",
      "ta": "VONE FY25 வருவாய் 123B லாபம் 12B BUY@82க்கு 30.4%+ வருமானம்"
    },
    "content": {
      "en": "Vallibel ONE (VONE LKR82.0), the holding company of RCL and LFIN, stands to benefit from improved performance by its subsidiaries. In FY25, VONE’s Equity Holders’ Profit rose 19% YoY, while revenue increased 0.4% YoY. Strong results from the Finance, Aluminium, Consumer, and Investment segments supported overall performance. With favourable macroeconomic conditions, rising disposable income, and innovation driven strategies, the Group is well positioned for growth. Trading at a PER of 7.9x and PBV of 0.9x, both below market averages, VONE offers a 10.8% ROE and a 5% DY. Hence, we maintain BUY on VONE with a Target Price of LKR106.9 (Upside 30.4%).",
      "si": "වල්ලිබෙල් වන් (VONE LKR82.0), RCL සහ LFIN හි හෝල්ඩිං සමාගම, එහි උපසමාගම්වල වැඩිදියුණු වූ කාර්ය සාධනයෙන් ප්‍රතිලාභ ලබයි. FY25 හි VONE හි කොටස් හිමියන්ගේ ලාභය YoY 19% කින් ඉහළ ගියේය, ආදායම YoY 0.4% කින් වැඩිවිය. මූල්‍ය, ඇලුමිනියම්, පාරිභෝගික සහ ආයෝජන අංශවල ශක්තිමත් ප්‍රතිඵල සමස්ත කාර්ය සාධනයට සහාය විය. හිතකර ආර්ථික තත්ත්වයන්, ඉහළ යන වියදම් හැකියාව සහ නව්‍ය උපාය මාර්ග සමඟ, කණ්ඩායම වර්ධනය සඳහා හොඳින් පිහිටා ඇත. PER 7.9x සහ PBV 0.9x යන අගයන් වෙළඳපොළ සාමාන්‍යයට වඩා අඩුය. VONE 10.8% ROE සහ 5% DY ලබා දෙයි. එබැවින්, LKR106.9 ඉලක්ක මිලක් (30.4% උඩුගත විභවය) සමඟ VONE සඳහා BUY තබා ගනිමු.",
      "ta": "வல்லிபெல் ஒன் (VONE LKR82.0), RCL மற்றும் LFIN இன் ஹோல்டிங் நிறுவனம், அதன் துணை நிறுவனங்களின் மேம்பட்ட செயல்திறனிலிருந்து பயனடைகிறது. FY25 இல் VONE இன் பங்குதாரர் லாபம் YoY 19% அதிகரித்தது, வருவாய் YoY 0.4% அதிகரித்தது. நிதி, அலுமினியம், நுகர்வோர் மற்றும் முதலீட்டு பிரிவுகளின் வலுவான முடிவுகள் மொத்த செயல்திறனை ஆதரித்தன. சாதகமான பொருளாதார சூழல், அதிகரிக்கும் செலவுத்திறன் மற்றும் புதுமை சார்ந்த உத்திகள் மூலம் குழு வளர்ச்சிக்கு நன்கு அமைந்துள்ளது. PER 7.9x மற்றும் PBV 0.9x ஆகியவை சந்தை சராசரிக்கு கீழே. VONE 10.8% ROE மற்றும் 5% DY வழங்குகிறது. எனவே, LKR106.9 இலக்கு விலை (30.4% மேல் நோக்கிய சாத்தியம்) உடன் VONE மீது BUY பரிந்துரைக்கிறோம்."
    },    "category": "Diversified Holdings",
    "expectedReturn": "30%",
    "timeFrame": "12 months",
    "publishDate": "2025-06-12",
    "image": "/images/Vallibel_One_Logo.png",
    "source": "Softlogic Research",
    "targetPrice": "LKR 106.9",
    "currentPrice": "LKR 82"
  },
  {
    "id": 3,
    "title": {
      "en": "Royal Ceramics (RCL) - 27%+ Upside, Beneficiary of Policy Change",
      "si": "රෝයල් සෙරමික්ස් (RCL) - 27%+ උඩුගත විභවය, ප්‍රතිපත්ති වෙනස්කමක ප්‍රතිලාභලාභී",
      "ta": "ராயல் செராமிக்ஸ் (RCL) - 27%+ மேல் நோக்கிய சாத்தியம், கொள்கை மாற்றத்தின் பயனாளி"
    },
    "summary": {
      "en": "RCL FY25 Rev 61B profit 5B BUY@40.7 for 26.5%+ return",
      "si": "RCL FY25 ආදායම 61B ලාභය 5B BUY@40.7 සඳහා 26.5%+ ප්‍රතිලාභය",
      "ta": "RCL FY25 வருவாய் 61B லாபம் 5B BUY@40.7க்கு 26.5%+ வருமானம்"
    },
    "content": {
      "en": "Royal Ceramics (RCL: LKR40.70), Sri Lanka's long awaited anti-dumping law if get implemented within the next few months and includes tiles as well, local tile manufacturers, including RCL, could be key beneficiaries. RCL with a dominant market share in wall tiles and in floor tiles together with an expected boost in demand from construction projects appears to be an attractive pick. With vehicle import ban being fully lifted, an increase in interest income from LFIN, could be further positive for RCL’s earnings growth. Based on a 12-month target price of LKR51.5, RCL offers a price gain of +26.5%.",
      "si": "රෝයල් සෙරමික්ස් (RCL: LKR40.70), ශ්‍රී ලංකාවේ බොහෝ කලක සිට බලාපොරොත්තු වූ ඇන්ටි-ඩම්පින් නීතිය ඉදිරි මාස කිහිපය තුළ ක්‍රියාත්මක වුවහොත් සහ ටයිල්ද ඇතුළත් නම්, RCL ඇතුළු දේශීය ටයිල් නිෂ්පාදකයින් ප්‍රධාන ප්‍රතිලාභලාභීන් විය හැකියි. බිත්ති ටයිල් සහ බිම් ටයිල් වල ප්‍රබල වෙළඳපොළ කොටසක් සහ ඉදිකිරීම් ව්‍යාපෘතිවලින් අපේක්ෂිත ඉල්ලුම වැඩිවීමත් සමඟ RCL ආකර්ෂණීය තේරීමක් ලෙස පෙනේ. වාහන ආනයන තහනම සම්පූර්ණයෙන් ඉවත් වීමත් සමඟ LFIN වෙතින් ලාභදායී ආදායම වැඩිවීමත් RCL හි ලාභ වර්ධනයට තවත් ධනාත්මක බලපෑමක් විය හැකියි. මාස 12ක ඉලක්ක මිල LKR51.5 අනුව, RCL +26.5%ක මිල වර්ධනයක් ලබා දෙයි.",
      "ta": "ராயல் செராமிக்ஸ் (RCL: LKR40.70), இலங்கையின் நீண்ட நாட்களாக எதிர்பார்க்கப்பட்ட ஆன்டி-டம்பிங் சட்டம் அடுத்த சில மாதங்களில் நடைமுறைக்கு வந்தால் மற்றும் டைல்களும் சேர்க்கப்பட்டால், உள்ளூர் டைல் உற்பத்தியாளர்கள், RCL உட்பட, முக்கிய பயனாளிகள் ஆகலாம். சுவை மற்றும் தரை டைல்களில் ஆதிக்கம் செலுத்தும் சந்தை பங்குடன், கட்டுமானத் திட்டங்களிலிருந்து எதிர்பார்க்கப்படும் தேவை அதிகரிப்பும் RCL ஐ ஒரு ஈர்க்கக்கூடிய தேர்வாக மாற்றுகிறது. வாகன இறக்குமதி தடையை முழுமையாக நீக்கியதால், LFIN இலிருந்து வட்டி வருமானம் அதிகரிப்பதும் RCL இன் லாப வளர்ச்சிக்கு மேலும் நேர்மறையாக இருக்கும். 12 மாத இலக்கு விலை LKR51.5 அடிப்படையில், RCL +26.5% விலை உயர்வை வழங்குகிறது."
    },    "category": "Manufacturing",
    "expectedReturn": "27%",
    "timeFrame": "12 months",
    "publishDate": "2025-06-12",
    "image": "/images/rocell.png",
    "source": "Softlogic Research",
    "targetPrice": "LKR 51.5",
    "currentPrice": "LKR 40.7"
  },
  {
    "id": 4,
    "title": {
      "en": "Hemas Holdings (HHL) - 24%+ Upside, Healthcare & FMCG Strength",
      "si": "හේමස් හෝල්ඩිංස් (HHL) - 24%+ උඩුගත විභවය, සෞඛ්‍ය හා FMCG ශක්තිය",
      "ta": "ஹேமாஸ் ஹோல்டிங்ஸ் (HHL) - 24%+ மேல் நோக்கிய சாத்தியம், சுகாதாரம் மற்றும் FMCG வலிமை"
    },
    "summary": {
      "en": "HHL FY25 Rev 118B profit 8B BUY@28.9 for 23.5%+ return",
      "si": "HHL FY25 ආදායම 118B ලාභය 8B BUY@28.9 සඳහා 23.5%+ ප්‍රතිලාභය",
      "ta": "HHL FY25 வருவாய் 118B லாபம் 8B BUY@28.9க்கு 23.5%+ வருமானம்"
    },
    "content": {
      "en": "Hemas Holdings PLC (HHL: LKR28.90), is well-positioned for sustained growth, supported by expected expansion of Hemas Thalawathugoda Hospital and potential investments in East Africa’s healthcare sector. Morison’s emphasis on high-margin, essential medications strengthens its role in affordable healthcare. HHL’s Consumer Brands retain market leadership in Sri Lanka’s FMCG space, driven by innovation and rising disposable incomes, while Atlas remains dominant in the education sector, with ongoing product development and market expansion. Recovery in Bangladesh also supports international growth. Based on a 12-month target price of LKR35.7, HHL offers a price gain of +23.5%.",
      "si": "හේමස් හෝල්ඩිංස් PLC (HHL: LKR28.90), තිරසාර වර්ධනය සඳහා හොඳින් පිහිටා ඇත, එය හේමස් තලවතුගොඩ රෝහලේ විස්තාරය සහ නැගෙනහිර අප්‍රිකාවේ සෞඛ්‍ය අංශයට ආයෝජන මත පදනම් වේ. මොරීසන්ගේ ඉහළ ලාභදායී, අත්‍යවශ්‍ය ඖෂධ මත අවධානය, අලභ්‍ය සෞඛ්‍ය සේවාවන්හි එහි භූමිකාව ශක්තිමත් කරයි. HHL හි පාරිභෝගික වෙළඳ නාමයන් ශ්‍රී ලංකාවේ FMCG අංශයේ වෙළඳපොළ නායකත්වය තබා ගනී, නව්‍යකරණය සහ ඉහළ යන ආදායම් මත පදනම්ව, Atlas අධ්‍යාපන අංශයේ පවතින ප්‍රබලත්වය තබා ගනී. බංග්ලාදේශයේ ප්‍රතිසංස්කරණය ජාත්‍යන්තර වර්ධනයටද සහාය වේ. මාස 12ක ඉලක්ක මිල LKR35.7 අනුව, HHL +23.5%ක මිල වර්ධනයක් ලබා දෙයි.",
      "ta": "ஹேமாஸ் ஹோல்டிங்ஸ் PLC (HHL: LKR28.90), நிலையான வளர்ச்சிக்கு நன்கு அமைந்துள்ளது, இது ஹேமாஸ் தலவத்துகொடா மருத்துவமனை விரிவாக்கம் மற்றும் கிழக்கு ஆப்பிரிக்காவின் சுகாதாரத் துறையில் முதலீடுகள் ஆகியவற்றால் ஆதரிக்கப்படுகிறது. மொரிசனின் அதிக லாபம் தரும், அத்தியாவசிய மருந்துகளின் மீது கவனம் செலுத்துவது மலிவான சுகாதாரத்தில் அதன் பங்கினை வலுப்படுத்துகிறது. HHL இன் நுகர்வோர் பிராண்டுகள் இலங்கையின் FMCG இடத்தில் சந்தை தலைமைத்துவத்தைத் தக்கவைத்துள்ளன, புதுமை மற்றும் அதிகரிக்கும் வருமானத்தால் இயக்கப்படுகின்றன, அதே சமயம் Atlas கல்வித் துறையில் ஆதிக்கம் செலுத்துகிறது, தொடர்ச்சியான தயாரிப்பு மேம்பாடு மற்றும் சந்தை விரிவாக்கத்துடன். பங்களாதேஷில் மீட்பு சர்வதேச வளர்ச்சிக்கும் ஆதரவளிக்கிறது. 12 மாத இலக்கு விலை LKR35.7 அடிப்படையில், HHL +23.5% விலை உயர்வை வழங்குகிறது."
    },    "category": "Conglomerate",
    "expectedReturn": "24%",
    "timeFrame": "12 months",
    "publishDate": "2025-06-12",
    "image": "/images/Hemas_Holdings_logo.svg.png",
    "source": "Softlogic Research",
    "targetPrice": "LKR 35.7",
    "currentPrice": "LKR 28.9"
  },
  {
    "id": 5,
    "title": {
      "en": "Dipped Products (DIPD) - 21%+ Upside, Global Expansion",
      "si": "ඩිප්ඩ් ප්‍රොඩක්ට්ස් (DIPD) - 21%+ උඩුගත විභවය, ගෝලීය විස්තාරය",
      "ta": "டிப்பட் புராடக்ட்ஸ் (DIPD) - 21%+ மேல் நோக்கிய சாத்தியம், உலகளாவிய விரிவாக்கம்"
    },
    "summary": {
      "en": "DIPD FY25 Rev 79B profit 4B BUY@56.1 for 21%+ return",
      "si": "DIPD FY25 ආදායම 79B ලාභය 4B BUY@56.1 සඳහා 21%+ ප්‍රතිලාභය",
      "ta": "DIPD FY25 வருவாய் 79B லாபம் 4B BUY@56.1க்கு 21%+ வருமானம்"
    },
    "content": {
      "en": "Dipped Products (DIPD: LKR56.1), exporting to over 70 countries, is well-positioned to benefit from U.S.-China trade tensions and a potential LKR depreciation, supporting future earnings. The recent Thailand acquisition expands capacity and lowers tariff exposure. In FY25, the Hand Protection segment contributed 58% of revenue, driven by strong demand and shifting global sourcing trends. The Plantation segment also improved, aided by higher volumes and prices. Despite Reciprocal tariff challenges, growth opportunities from geographic expansion in Sri Lanka and Thailand remain compelling for DIPD. Hence maintain BUY with a target price of LKR67.8 (Upside +20.8%).",
      "si": "ඩිප්ඩ් ප්‍රොඩක්ට්ස් (DIPD: LKR56.1), රටවල් 70කට වැඩි ප්‍රමාණයකට අපනයනය කරමින්, ඇමරිකා-චීන වෙළඳ ආරවුල් සහ LKR අවප්‍රමාණය වැනි කරුණු වලින් අනාගත ආදායම් සඳහා වාසි ලබා ගත හැකියි. තායිලන්තයේ නව අත්පත් කර ගැනීම ධාරිතාව වැඩි කරයි සහ බදු අවදානම අඩු කරයි. FY25 හි, අත් ආරක්ෂණ අංශය ආදායමේ 58%ක් ලබා දුන්නේ ශක්තිමත් ඉල්ලුම සහ ගෝලීය සම්පාදන ප්‍රවණතා වෙනස් වීම නිසාය. වගාව අංශයද වැඩි පරිමාණ සහ මිලවලින් වාසි ලබා ගත්තේය. ප්‍රතිචාරක බදු අභියෝග තිබුණද, ශ්‍රී ලංකාව සහ තායිලන්තය තුළ භූගෝලීය විස්තාරයෙන් DIPD සඳහා වර්ධන අවස්ථා තවදුරටත් ආකර්ෂණීය වේ. එබැවින්, LKR67.8 ඉලක්ක මිලක් (උඩුගත විභවය +20.8%) සමඟ BUY තබා ගන්න.",
      "ta": "டிப்பட் புராடக்ட்ஸ் (DIPD: LKR56.1), 70க்கும் மேற்பட்ட நாடுகளுக்கு ஏற்றுமதி செய்கிறது, அமெரிக்கா-சீனா வர்த்தக பதற்றம் மற்றும் சாத்தியமான LKR மதிப்பிழப்பு ஆகியவற்றிலிருந்து எதிர்கால வருவாய்க்கு ஆதாயம் கிடைக்கும். சமீபத்திய தாய்லாந்து வாங்குதல் திறனை அதிகரிக்கிறது மற்றும் வரி பாதிப்பை குறைக்கிறது. FY25 இல், கை பாதுகாப்பு பிரிவு வருவாயில் 58% பங்களித்தது, வலுவான தேவை மற்றும் மாற்றும் உலகளாவிய ஆதாயப் போக்குகளால் இயக்கப்பட்டது. தோட்டப்பிரிவும் அதிகமான அளவு மற்றும் விலையால் மேம்பட்டது. பரஸ்பர வரி சவால்கள் இருந்தாலும், இலங்கை மற்றும் தாய்லாந்தில் புவியியல் விரிவாக்கத்திலிருந்து DIPDக்கு வளர்ச்சி வாய்ப்புகள் தொடர்ந்து ஈர்க்கக்கூடியவை. எனவே, இலக்கு விலை LKR67.8 (மேல் நோக்கிய சாத்தியம் +20.8%) உடன் BUY பரிந்துரைக்கிறோம்."
    },    "category": "Export Manufacturing",
    "expectedReturn": "21%",
    "timeFrame": "12 months",
    "publishDate": "2025-06-12",
    "image": "/images/dipped-products--600.png",
    "source": "Softlogic Research",
    "targetPrice": "LKR 67.8",
    "currentPrice": "LKR 56.1"
  },
  {
    "id": 6,
    "title": {
      "en": "Vidullanka (VLL.N) - 26%+ Upside, Renewable Energy Leader",
      "si": "විදුල්ලංකා (VLL.N) - 26%+ උඩුගත විභවය, නවීන බලශක්ති නායකයා",
      "ta": "விடுல்லங்கா (VLL.N) - 26%+ மேல் நோக்கிய சாத்தியம், புதுமைமிக்க ஆற்றல் முன்னணி"
    },
    "summary": {
      "en": "VLL FY25 Rev 5B profit 1.5B BUY@13.5 for 25.9%+ return",
      "si": "VLL FY25 ආදායම 5B ලාභය 1.5B BUY@13.5 සඳහා 25.9%+ ප්‍රතිලාභය",
      "ta": "VLL FY25 வருவாய் 5B லாபம் 1.5B BUY@13.5க்கு 25.9%+ வருமானம்"
    },
    "content": {
      "en": "Vidullanka (VLL.N: LKR13.5) stands out in the renewable energy sector with the highest 4-year topline CAGR of 31.8% and the highest equity holders’ profit CAGR of 24.6% over FY21-25. Backed by continued investments in solar power, the company is diversifying its revenue streams and enhancing growth potential. With a strong ROCE of 24% and the highest DY in the sector at 13%, VLL offers both capital appreciation and attractive returns to investors. Hence recommend BUY on VLL.N, with a target price of LKR17.0, (price upside +25.9%).",
      "si": "විදුල්ලංකා (VLL.N: LKR13.5) නවීන බලශක්ති අංශයේ වසර 4ක ඉහළම CAGR 31.8% සහ කොටස් හිමියන්ගේ ලාභයේ ඉහළම CAGR 24.6% (FY21-25) සමඟ ප්‍රබලයි. සූර්ය බලශක්ති ආයෝජන අඛණ්ඩව සිදු කිරීමෙන් සමාගම ආදායම් ධාරාවන් විවිධාකාර කරමින් වර්ධන විභවය වැඩි කරයි. ROCE 24%ක් සහ අංශයේ ඉහළම DY 13%ක් සමඟ, VLL ආයෝජකයින්ට මූල්‍ය වර්ධනය සහ ආකර්ෂණීය ප්‍රතිලාභ දෙකම ලබා දෙයි. එබැවින්, LKR17.0 ඉලක්ක මිලක් (උඩුගත විභවය +25.9%) සමඟ VLL.N සඳහා BUY නිර්දේශ කරමු.",
      "ta": "விடுல்லங்கா (VLL.N: LKR13.5) புதுமைமிக்க ஆற்றல் துறையில் கடந்த 4 ஆண்டுகளில் (FY21-25) அதிகபட்ச வருவாய் CAGR 31.8% மற்றும் பங்குதாரர் லாப CAGR 24.6% உடன் முன்னணியில் உள்ளது. தொடர்ச்சியான சோலார் முதலீடுகளால் நிறுவனம் வருவாய் வழிகளை பல்வகைப்படுத்தி வளர்ச்சி வாய்ப்பை அதிகரிக்கிறது. ROCE 24% மற்றும் துறையில் அதிகபட்ச DY 13% உடன், VLL முதலீட்டாளர்களுக்கு மூலதன மதிப்பீடு மற்றும் ஈர்க்கக்கூடிய வருமானம் இரண்டையும் வழங்குகிறது. எனவே, இலக்கு விலை LKR17.0 (மேல் நோக்கிய சாத்தியம் +25.9%) உடன் VLL.N மீது BUY பரிந்துரைக்கிறோம்."
    },    "category": "Renewable Energy",
    "expectedReturn": "26%",
    "timeFrame": "12 months",
    "publishDate": "2025-06-12",
    "image": "/images/vidullanka_plc_logo.jpg",
    "source": "Softlogic Research",
    "targetPrice": "LKR 17.0",
    "currentPrice": "LKR 13.5"
  }
]
